# -*- coding: utf-8 -*-
'''
Задание 5.1

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''
#Решение
ip = input('Введите IP-сеть в формате x.x.x.x/yy:    ')
a = ip.split('/')
a1 = a[0].split('.')
print('Network:' + '\n' + '{:<10} {:<10} {:<10} {:<10}'.format(a1[0], a1[1], a1[2], a1[3]))
b = [int(vlan) for vlan in a1]
b[0] = '{:08b}'.format(b[0])
b[1] = '{:08b}'.format(b[1])
b[2] = '{:08b}'.format(b[2])
b[3] = '{:08b}'.format(b[3])
print('{:10} {:10} {:10} {:10}'.format(b[0], b[1], b[2], b[3]))
print ('\n')
print('Mask :')
print('/' + a[1])
m_bin = '1' * int(a[1]) + '0' * (32 - int(a[1]))
m0 = int(m_bin[0:8], 2)
m1 = int(m_bin[8:16], 2)
m2 = int(m_bin[16:24], 2)
m3 = int(m_bin[24:32], 2)
print('{:10} {:10} {:10} {:10}'.format(str(m0), str(m1), str(m2), str(m3)))
print('{:10} {:10} {:10} {:10}'.format(m_bin[0:8], m_bin[9:16], m_bin[17:24], m_bin[24:32]))